; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	spectrograph2 - mode
	infrared1 - mode
	spectrograph4 - mode
	image3 - mode
	infrared0 - mode
	GroundStation0 - direction
	Star5 - direction
	GroundStation3 - direction
	Star1 - direction
	Star4 - direction
	Star6 - direction
	Star2 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon14)
	(supports instrument1 image3)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument2 spectrograph4)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star4)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph4)
	(supports instrument3 image3)
	(calibration_target instrument3 Star4)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star6)
	(supports instrument5 infrared0)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star2)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
)
(:goal (and
	(pointing satellite0 Phenomenon14)
	(pointing satellite1 Planet8)
	(pointing satellite3 Phenomenon14)
	(have_image Phenomenon7 spectrograph4)
	(have_image Planet8 infrared1)
	(have_image Star9 infrared1)
	(have_image Phenomenon10 spectrograph2)
	(have_image Star11 image3)
	(have_image Phenomenon12 image3)
	(have_image Star13 infrared0)
	(have_image Phenomenon14 spectrograph4)
	(have_image Phenomenon15 spectrograph4)
))

)

; plan
1. (turn_to satellite3 star2 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 star2)
   goals met: 1 of 12
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 12
3. (calibrate satellite1 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 1 of 12
4. (turn_to satellite1 phenomenon7 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon7)
   goals met: 1 of 12
5. (take_image satellite1 phenomenon7 instrument1 spectrograph4)
   added: (have_image phenomenon7 spectrograph4)
   goals met: 2 of 12
6. (turn_to satellite1 phenomenon15 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon15)
   goals met: 2 of 12
7. (take_image satellite1 phenomenon15 instrument1 spectrograph4)
   added: (have_image phenomenon15 spectrograph4)
   goals met: 3 of 12
8. (turn_to satellite1 phenomenon14 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon14)
   goals met: 3 of 12
9. (take_image satellite1 phenomenon14 instrument1 spectrograph4)
   added: (have_image phenomenon14 spectrograph4)
   goals met: 4 of 12
10. (turn_to satellite1 phenomenon12 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon12)
   goals met: 4 of 12
11. (take_image satellite1 phenomenon12 instrument1 image3)
   added: (have_image phenomenon12 image3)
   goals met: 5 of 12
12. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 5 of 12
13. (calibrate satellite3 instrument5 star2)
   added: (calibrated instrument5)
   goals met: 5 of 12
14. (turn_to satellite1 star11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star11)
   goals met: 5 of 12
15. (take_image satellite1 star11 instrument1 image3)
   added: (have_image star11 image3)
   goals met: 6 of 12
16. (turn_to satellite1 star9 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star9)
   goals met: 6 of 12
17. (take_image satellite1 star9 instrument1 infrared1)
   added: (have_image star9 infrared1)
   goals met: 7 of 12
18. (turn_to satellite1 planet8 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet8)
   goals met: 8 of 12
19. (take_image satellite1 planet8 instrument1 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 9 of 12
20. (turn_to satellite3 phenomenon10 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 phenomenon10)
   goals met: 9 of 12
21. (take_image satellite3 phenomenon10 instrument5 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 10 of 12
22. (turn_to satellite3 star13 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 star13)
   goals met: 10 of 12
23. (take_image satellite3 star13 instrument5 infrared0)
   added: (have_image star13 infrared0)
   goals met: 11 of 12
24. (turn_to satellite3 phenomenon14 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 phenomenon14)
   goals met: 12 of 12
